#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2020/1/4 11:42
# @File    : Day02.py
# @Software: PyCharm
#题目：企业发的奖金根据利润提成，利润(I)低于或等于10万元时，奖金可提10%；
# 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元部分可提成7.5%
# 20万元到40万元之间，高于20万的部分，可提成5%；
# 40万元到60万元之间，高于40万元的部分，可提成3%
# 60万元到100万元之间，高于60万元的部分，可提成1.5%
#高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I
#求应发奖金总数


def get_bonous(profit):
    if profit <=  100000:
        return profit * 0.1
    if ((profit > 100000) and (profit <= 200000)):
        return (profit-100000) * 0.075 +  100000 * 0.1
    if ((profit > 200000) and (profit <=400000)):
        return (profit -200000)*0.05 + 100000*0.075 + 100000*0.1
    if((profit >400000)and (profit <= 600000)):
        return (profit -400000)*0.03 +  200000*0.05 + 100000*0.075 + 100000*0.1
    if((profit > 600000) and (profit <= 1000000)):
        return (profit - 600000)*0.015 +  200000*0.03 + 200000*0.5 + 100000*0.075 + 100000*0.1
    if(profit > 1000000):
        return (profit -1000000)*0.01 + 400000*0.015 + 200000*0.03 + 200000* 0.5 + 100000 * 0.075 + 100000*0.1


if __name__ == '__main__':
    while 1:
        profit = int(input())
        print(get_bonous(profit))